dck982/coffeeflow/firmware/screen/sdkconfig.defaults
# Défauts de projet — module écran (Waveshare ESP32-S3-Touch-LCD-4.3,
# flash 16 Mo, 8 Mo PSRAM). Complète, ne remplace pas, la config par défaut
# d'ESP-IDF v5.1 (voir firmware/IDF_VERSION.md).

CONFIG_IDF_TARGET="esp32s3"

CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"
CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y

# PSRAM 8 Mo, nécessaire pour le framebuffer RGB 800x480 (phase 6, LVGL).
CONFIG_SPIRAM=y
CONFIG_SPIRAM_MODE_OCT=y
CONFIG_SPIRAM_SPEED_80M=y

# LVGL (lot 2, docs/plan-phase6.md) : police montserrat pour le titre de
# l'écran de service, le reste des labels utilise la police par défaut.
CONFIG_LV_FONT_MONTSERRAT_20=y

# Rollback applicatif : voir sensors/sdkconfig.defaults, même mécanisme.
CONFIG_BOOTLOADER_APP_ROLLBACK_ENABLE=y

CONFIG_ESP_TASK_WDT_EN=y

CONFIG_TWAI_SUPPRESS_DEPRECATE_WARN=y

# Console désactivée (primaire ET secondaire) : UART0 est piloté directement
# par le pont série<->CAN via son driver bas niveau (pas le port USB natif,
# voir le commentaire en tête de main.cpp — câblage réel de ce banc) ; sans
# ça, la console ESP-IDF se dispute UART0 avec notre driver.
CONFIG_ESP_CONSOLE_NONE=y
CONFIG_ESP_CONSOLE_SECONDARY_NONE=y

# CONFIG_LCD_RGB_RESTART_IN_VSYNC essayé puis abandonné (2026-09-09,
# diagnostic glitch résiduel lot 2) : résultat nettement pire (sauts
# verticaux du contenu en plus du glitch existant). Ne pas réessayer sans
# comprendre pourquoi ce panneau/driver y réagit mal.
CONFIG_HTTPD_WS_SUPPORT=y
CONFIG_HTTPD_WS_PRE_HANDSHAKE_CB_SUPPORT=y
CONFIG_HTTPD_WS_POST_HANDSHAKE_CB_SUPPORT=y
